STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
/**
 ******************************************************************************
 * @file    ancs_client_app.c
 * @author  MCD Application Team
 * @brief   ANCS client Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "dbg_trace.h"

#include "ble.h"
#include "app_ble.h"    
#include "ancs_client_app.h"

#include "stm32_seq.h"

/* Private defines -----------------------------------------------------------*/

#define GET_ACTION_ID_FROM_UART 0

/* MAX Number of entry in the context lists */
#define MAX_NMB_NOTIFY         128
#define MAX_DISPLAY_NAME_LEN   128
#define MAX_DATA_LIST_LEN      0xFF
#define MAX_DATA_LEN           0x0128

/**
 * The default GAP command timeout is set to 30s
 */
#define GAP_DEFAULT_TIMEOUT (30000)

/**
 * The default GATT command timeout is set to 30s
 */
#define GATT_DEFAULT_TIMEOUT (30000)


/* Invalid Notify Entry */
#define INVALID_NOTIFY_ENTRY   0xFFFF

#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))

/* copy UUID to tab */
#define COPY_UUID_128(uuid_struct, uuid_15, uuid_14, uuid_13, uuid_12, uuid_11, uuid_10, uuid_9, uuid_8, uuid_7, uuid_6, uuid_5, uuid_4, uuid_3, uuid_2, uuid_1, uuid_0) \
do {\
    uuid_struct[0] = uuid_0; uuid_struct[1] = uuid_1; uuid_struct[2] = uuid_2; uuid_struct[3] = uuid_3; \
        uuid_struct[4] = uuid_4; uuid_struct[5] = uuid_5; uuid_struct[6] = uuid_6; uuid_struct[7] = uuid_7; \
            uuid_struct[8] = uuid_8; uuid_struct[9] = uuid_9; uuid_struct[10] = uuid_10; uuid_struct[11] = uuid_11; \
                uuid_struct[12] = uuid_12; uuid_struct[13] = uuid_13; uuid_struct[14] = uuid_14; uuid_struct[15] = uuid_15; \
}while(0)

/* UUIDs list for ANCS service and characteristics*/
#define COPY_ANCS_SERVICE_UUID(uuid_struct)                      COPY_UUID_128(uuid_struct, 0x79, 0x05, 0xF4, 0x31, 0xB5, 0xCE, 0x4E, 0x99, 0xA4, 0x0F, 0x4B, 0x1E, 0x12, 0x2D, 0x00, 0xD0)
#define COPY_ANCS_NOTIFICATION_SOURCE_UUID(uuid_struct)          COPY_UUID_128(uuid_struct, 0x9F, 0xBF, 0x12, 0x0D, 0x63, 0x01, 0x42, 0xD9, 0x8C, 0x58, 0x25, 0xE6, 0x99, 0xA2, 0x1D, 0xBD)
#define COPY_ANCS_DATA_SOURCE_UUID(uuid_struct)                  COPY_UUID_128(uuid_struct, 0x22, 0xEA, 0xC6, 0xE9, 0x24, 0xD6, 0x4B, 0xB5, 0xBE, 0x44, 0xB3, 0x6A, 0xCE, 0x7C, 0x7B, 0xFB)
#define COPY_ANCS_CONTROL_POINT_UUID(uuid_struct)                COPY_UUID_128(uuid_struct, 0x69, 0xD1, 0xD8, 0xF3, 0x45, 0xE1, 0x49, 0xA8, 0x98, 0x21, 0x9B, 0xBD, 0xFD, 0xAA, 0xD9, 0xD9)

/* Private typedef -----------------------------------------------------------*/
typedef enum
{
  GAP_PROC_TERMINATE_CONNECTION,
  GAP_PROC_SLAVE_SECURITY_REQ,
  GAP_PROC_PASS_KEY_RESPONSE,
  GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM,
  GAP_PROC_ALLOW_REBOND,
} GapProcId_t;

typedef enum
{
  GATT_PROC_MTU_UPDATE,
  GATT_PROC_DISC_ANCS_SERVICE,
  GATT_PROC_DISC_ALL_PRIMARY_SERVICES,
  GATT_PROC_DISC_ALL_CHARS,
  GATT_PROC_DISC_ALL_DESCS,
  GATT_PROC_ENABLE_ALL_NOTIFICATIONS,
} GattProcId_t;

typedef enum
{
  ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE,
  ANCS_PROC_GET_APP_ATTRIBUTE,
  ANCS_PROC_PERFORM_NOTIFICATION_ACTION,
} AncsProcId_t;

/**
   * structure of fields for GATT notication source characteristic
   */
typedef struct notifyListS {
  uint8_t    used;           /*flag to indicate notification processed or not*/
  EventID    evID;
  EventFlags evFlag;
  CategoryID catID;
  uint8_t    catCount;
  uint32_t   notifUID;  
} notifyList_type;
 
/**
   * structure of ANCS context (containing all needed settings: events state, handlers, inputs...)
   */
typedef struct ancs_contextS {
  
  ANCS_ProfileState state;
  uint16_t connection_handle;
  
  uint8_t Peer_Bonded;
  uint8_t Security_Mode;
  uint8_t Security_Level;
  uint8_t Peer_Address_Type;
  uint8_t Peer_Address[6];
  
  uint8_t appDisplayName_len;
  uint8_t appDisplayName[MAX_DISPLAY_NAME_LEN];
  uint8_t AppIdentifierLength;
  uint8_t AppIdentifier[MAX_DISPLAY_NAME_LEN];
  uint8_t list[MAX_DATA_LIST_LEN];
  
  notifyList_type notifyList[MAX_NMB_NOTIFY];
  
  uint16_t notifyEntry; /* index of input notification */
  uint8_t notifyShowed; /* flag to indicate notification has already been displayed */
  uint32_t startTime;
  uint8_t genericFlag;  /* action done after notification */

  uint16_t ALLServiceStartHandle;
  uint16_t ALLServiceEndHandle;

  uint16_t GAPServiceStartHandle;
  uint16_t GAPServiceEndHandle;
  
  uint16_t GAPCentralAddressResolutionCharStartHdle;
  uint16_t GAPCentralAddressResolutionCharValueHdle;
  uint16_t GAPCentralAddressResolutionCharDescHdle;
  uint16_t GAPCentralAddressResolutionCharEndHdle;
  
  uint16_t GATTServiceStartHandle;
  uint16_t GATTServiceEndHandle;

  uint16_t ServiceChangedCharStartHdle;
  uint16_t ServiceChangedCharValueHdle;
  uint16_t ServiceChangedCharDescHdle;
  uint16_t ServiceChangedCharEndHdle;

  uint16_t ANCSServiceStartHandle;
  uint16_t ANCSServiceEndHandle;
    
  uint16_t ANCSNotificationSourceCharStartHdle;
  uint16_t ANCSControlPointCharStartHdle;
  uint16_t ANCSDataSourceCharStartHdle;
  
  uint16_t ANCSNotificationSourceCharValueHdle;
  uint16_t ANCSControlPointCharValueHdle;
  uint16_t ANCSDataSourceCharValueHdle;
  
  uint16_t ANCSNotificationSourceCharDescHdle;
  uint16_t ANCSControlPointCharDescHdle;
  uint16_t ANCSDataSourceCharDescHdle;

} ancs_context_type;

/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("BLE_APP_CONTEXT") static ancs_context_type ancs_context;

/* Global variables ----------------------------------------------------------*/
uint16_t gCharUUID=0,gCharStartHandle=0,gCharValueHandle=0,gCharDescriptorHandle=0;

