STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
#if (GET_ACTION_ID_FROM_UART == 1)
extern UART_HandleTypeDef huart1;
#endif
/* Private function prototypes -----------------------------------------------*/
static void gap_cmd_resp_wait(uint32_t timeout);
static void gap_cmd_resp_release(uint32_t flag);
static void GapProcReq(GapProcId_t GapProcId);
static void gatt_cmd_resp_wait(uint32_t timeout);
static void gatt_cmd_resp_release(uint32_t flag);
static void GattProcReq(GattProcId_t GattProcId);
static void GattParseServicesByUUID(aci_att_find_by_type_value_resp_event_rp0 *pr);
static void GattParseServices(aci_att_read_by_group_type_resp_event_rp0 *pr);
static void GattParseChars(aci_att_read_by_type_resp_event_rp0 *pr);
static void GattParseDescs(aci_att_find_info_resp_event_rp0 *pr);
static void GattParseNotification(aci_gatt_notification_event_rp0 *pr);

#if (GET_ACTION_ID_FROM_UART == 1)
static uint8_t ANCS_App_Get_Char(void);
static ActionID ANCS_App_Get_ActionID(void)
#endif
static void ANCS_App_Update_Service( void );
static SVCCTL_EvtAckStatus_t ANCS_Client_Event_Handler( void *Event );

void ANCS_Notification_Check(EventFlags EventFlagMask);
void ANCS_Client_Reset( void );
static void AncsProcReq(AncsProcId_t AncsProcId);

	
/* Functions Definition ------------------------------------------------------*/
/* Private functions ----------------------------------------------------------*/
/**
   * Display Event ID notified in ANCS notification source characteristic
   */
static void ANCS_Show_EventID(EventID evID)
{
  switch(evID) {
  case EventIDNotificationAdded:
    printf("** EventID: Added\r\n");
    break;
  case EventIDNotificationModified:
    printf("** EventID: Modified\r\n");
    break;
  case EventIDNotificationRemoved:
    printf("** EventID: Removed\r\n");
    break;
  }
}

/**
   * Display Event Flag notified in ANCS notification source characteristic
   */
static void ANCS_Show_EventFlag(EventFlags evFlag)
{
  switch (evFlag) {
  case EventFlagSilent:
    printf("** EventFlag: Silent\r\n");
    break;
  case EventFlagImportant:
    printf("** EventFlag: Important\r\n");
    break;
  case EventFlagPreExisting:
    printf("** EventFlag: Pre Existing\r\n");
    break;
  case EventFlagPositiveAction:
    printf("** EventFlag: Positive Action\r\n");
    break;
  case EventFlagNegativeAction:
    printf("** EventFlag: Negative Action\r\n");	
    break;
  }

  printf("** EventFlags:");
  if ((evFlag & EventFlagSilent) == EventFlagSilent) printf(" Silent");
  if ((evFlag & EventFlagImportant) == EventFlagImportant) printf(" Important");
  if ((evFlag & EventFlagPreExisting) == EventFlagPreExisting) printf(" PreExisting");
  if ((evFlag & EventFlagPositiveAction) == EventFlagPositiveAction) printf(" PositiveAction");
  if ((evFlag & EventFlagNegativeAction) == EventFlagNegativeAction) printf(" NegativeAction");
  printf("\n\r");
  
}

/**
   * Display CategoryID notified in ANCS notification source characteristic
   */
static void ANCS_Show_CategoryID(CategoryID catID)
{
  switch (catID) {
  case CategoryIDOther:
    printf("** CategoryID: Other\r\n");
    break;
  case CategoryIDIncomingCall:
    printf("** CategoryID: Incoming Call\r\n");
    break;
  case CategoryIDMissedCall:
    printf("** CategoryID: Missed Call\r\n");
    break;
  case CategoryIDVoicemail:
    printf("** CategoryID: Voice Mail\r\n");
    break;
  case CategoryIDSocial:
    printf("** CategoryID: Social\r\n");
    break;
  case CategoryIDSchedule:
    printf("** CategoryID: Schedule\r\n");
    break;
  case CategoryIDEmail:
    printf("** CategoryID: Email\r\n");
    break;
  case CategoryIDNews:
    printf("** CategoryID: News\r\n");
    break;
  case CategoryIDHealthAndFitness:
    printf("** CategoryID: Healt and Fitness\r\n");
    break;
  case CategoryIDBusinessAndFinance:
    printf("** CategoryID: Business and Finance\r\n");
    break;
  case CategoryIDLocation:
    printf("** CategoryID: Location\r\n");
    break;
  case CategoryIDEntertainment:
    printf("** CategoryID: Entertainment\r\n");
    break;
  }
}

/**
   * Display Notification AttributeID for Get Notification Attributes command from NC
   */
static void ANCS_Show_Attr(NotificationAttributeID attrID)
{
  switch (attrID) {
  case NotificationAttributeIDAppIdentifier:
    printf("** AppIdentifier: ");
    break;
  case NotificationAttributeIDTitle:
    printf("** Title: ");
    break;
  case NotificationAttributeIDSubtitle:
    printf("** SubTitle: ");
    break;
  case NotificationAttributeIDMessage:
    printf("** Message: ");
    break;
  case NotificationAttributeIDMessageSize:
    printf("** MessageSize: ");
    break;
  case NotificationAttributeIDDate:
    printf("** Date: ");
    break;
  case NotificationAttributeIDPositiveActionLabel:
    printf("** PositiveActionLabel: ");
    break;
  case NotificationAttributeIDNegativeActionLabel:
    printf("** NegativeActionLabel: ");
    break;
  }
}

/**
   * Display App AttributeID used in Get App Attributes command from NC
   */
static void ANCS_Show_AppAttr(AppAttributeID appAttrID)
{
  printf("\r\n*************** App Attribute Infomation Received **********************\r\n");
  switch (appAttrID) {
  case AppAttributeIDDisplayName:
    printf("** DisplayName: ");
    break;
  }
}

/**
   * Display different fields for GATT notication source characteristic received
   */
static void ANCS_Show_Notification(uint16_t index)
{
  printf("\r\n*************** Data Source Detail Infomation Received **********************\r\n");
  ANCS_Show_EventID((EventID)ancs_context.notifyList[index].evID);
  ANCS_Show_EventFlag((EventFlags)ancs_context.notifyList[index].evFlag);
  ANCS_Show_CategoryID((CategoryID)ancs_context.notifyList[index].catID);
  printf("** CategoryCount: %d\r\n", ancs_context.notifyList[index].catCount);
  printf("** NotificationUID: 0x%08x\r\n", (int)ancs_context.notifyList[index].notifUID);
}

/**
   * create Get Notification Attributes command to NP from UID notification and action flags inputs
   */   
static void ANCS_Cmd_GetNotificationAttr(notificationAttr_type attr)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t CmdSize = 0;
  uint8_t CmdGetNotificationAtt[19]={CommandIDGetNotificationAttributes,
					   0x00,0x00,0x00,0x00,
					   NotificationAttributeIDAppIdentifier,
					   NotificationAttributeIDTitle,0xFF,0xFF,
					   NotificationAttributeIDSubtitle,0xFF,0xFF,
					   NotificationAttributeIDMessage,0xFF,0xFF,
					   NotificationAttributeIDMessageSize,
					   NotificationAttributeIDDate,
					   NotificationAttributeIDPositiveActionLabel,
					   NotificationAttributeIDNegativeActionLabel};

  CmdGetNotificationAtt[CmdSize++] = CommandIDGetNotificationAttributes;

  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.UID >> 0) & 0xFF);
  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.UID >> 8) & 0xFF);
  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.UID >> 16) & 0xFF);
  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.UID >> 24) & 0xFF);

  if (attr.appID_flag == TRUE) 
  {
  	CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDAppIdentifier; 
  }
  
  if ( (attr.title_flag == TRUE) && (attr.title_max_size != 0x00) )
  {
    CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDTitle;
	  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.title_max_size >> 0) & 0xFF);
	  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.title_max_size >> 8) & 0xFF);
  }
  
  if ( (attr.subtitle_flag == TRUE) && (attr.subtitle_max_size!= 0x00) )
  {
    CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDSubtitle;
	  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.subtitle_max_size >> 0) & 0xFF);
	  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.subtitle_max_size >> 8) & 0xFF);
  }
  
  if ( (attr.message_flag == TRUE) && (attr.message_max_size != 0x00) )
  {
    CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDMessage;
	  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.message_max_size >> 0) & 0xFF);
	  CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.message_max_size >> 8) & 0xFF);
  }
  
  if (attr.messageSize_flag == TRUE) 
  {
  	CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDMessageSize; 
  }
  
  if (attr.date_flag == TRUE) 
  {
  	CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDDate; 
  }
  
  if (attr.positiveAction_flag == TRUE) 
  {
  	CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDPositiveActionLabel; 
  }
  
