STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
  if (attr.negativeAction_flag == TRUE) 
  {
  	CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDNegativeActionLabel; 
  }

  result = aci_gatt_write_char_value( ancs_context.connection_handle,
							ancs_context.ANCSControlPointCharValueHdle,
							CmdSize,
							(uint8_t *)CmdGetNotificationAtt);
  gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
  if (result != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG(" aci_gatt_write_char_value cmd NOK status =0x%02X \n",result);
  }
  
}


/**
   * create Perform Notification Action command from UID notification received and desired action ID
   */ 
static void ANCS_Cmd_PerformNotificationAction(uint32_t notificationUID, ActionID actID)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t CmdSize = 0;
  uint8_t CmdPerformNotificationAction[6]={CommandIDPerformNotificationAction,
  			 0x00,0x00,0x00,0x00,
  			 ActionIDPositive };
  
  CmdPerformNotificationAction[CmdSize++] = CommandIDPerformNotificationAction;
  CmdPerformNotificationAction[CmdSize++] = (uint8_t)((notificationUID >> 0) & 0xFF);
  CmdPerformNotificationAction[CmdSize++] = (uint8_t)((notificationUID >> 8) & 0xFF);
  CmdPerformNotificationAction[CmdSize++] = (uint8_t)((notificationUID >> 16) & 0xFF);
  CmdPerformNotificationAction[CmdSize++] = (uint8_t)((notificationUID >> 24) & 0xFF);
  CmdPerformNotificationAction[CmdSize++] = actID;
    
  result = aci_gatt_write_char_value(ancs_context.connection_handle,
  							ancs_context.ANCSControlPointCharValueHdle,
  							CmdSize,
  							(uint8_t *)CmdPerformNotificationAction);
  gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
  if (result != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG(" aci_gatt_write_char_value cmd NOK status =0x%02X \n",result);
  }
}

/**
   * create Get App Attributes command to NP for number of wanted AppIdentifiers input
   */  
static void ANCS_Cmd_GetAppAttr(uint8_t AppIdentifierLength, char *AppIdentifier/* NULL Terminated*/)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t CmdSize = 0;
  uint8_t CmdGetAppAtt[128]={0};
  
  CmdGetAppAtt[CmdSize++] = CommandIDGetAppAttributes;
  
  /*Number of wanted App Identifiers*/
  for (int idx=0;idx<AppIdentifierLength;idx++)
    CmdGetAppAtt[CmdSize++] = AppIdentifier[idx];
  
  CmdGetAppAtt[CmdSize++] = AppAttributeIDDisplayName;
	
  result = aci_gatt_write_char_value( ancs_context.connection_handle,
  						 ancs_context.ANCSControlPointCharValueHdle,
  						 CmdSize,
  						 (uint8_t *)CmdGetAppAtt);
  gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
  if (result != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG(" aci_gatt_write_char_value cmd NOK status =0x%02X \n",result);
  }
}

/**
* Parser of response for Get Notification Attributes command
* number of received attributes and attributes list input
*/ 
static void ANCS_Parse_GetNotificationAttr_Resp(uint8_t  commandID, uint16_t attrLen, uint8_t  *attrList)
{
  uint8_t appId,PositiveActionLabel,NegativeActionLabel;
  uint16_t len, index;

  appId = FALSE;
  PositiveActionLabel = FALSE;
  NegativeActionLabel = FALSE;
  index = 0;
  
  if(commandID == CommandIDGetNotificationAttributes) 
  {
    /* loop on number of attribute IDs */
    while (index < attrLen) 
    {
      /* attrList[index+0] corresponding to AttributeID x*/
      Osal_MemCpy(&len, &attrList[index+1], 2); /* AttributeID x Value Length */
      if (len == 0)  /* Empty */
      {
        index += 3;
      } 
      else 
      {
        /* AttributeID x */
          if (!ancs_context.notifyShowed) {
            ANCS_Show_Notification(ancs_context.notifyEntry);
            ancs_context.notifyShowed = TRUE;
          }
          ANCS_Show_Attr((NotificationAttributeID)attrList[index]); /* Notification AttributeID x*/
        
        /* AttributeID for Application identifier */
        if (attrList[index] == NotificationAttributeIDAppIdentifier) 
        {
          appId = TRUE;
        }
	else if (attrList[index] == NotificationAttributeIDPositiveActionLabel)
        {
          PositiveActionLabel = TRUE;
        }
	else if (attrList[index] == NotificationAttributeIDNegativeActionLabel)
        {
          NegativeActionLabel = TRUE;
        }
		
        /* AttributeID x Value */
        index++;
        if (len <= sizeof(ancs_context.list)) 
        {
          Osal_MemCpy(ancs_context.list, &attrList[index+2], len);
          ancs_context.list[len] = '\0';
        } 
        else 
        {
          APP_DBG_MSG("cut the AttributeID x Value len=%d <= sizeof(ancs_context.list)=%d \n\r",len,sizeof(ancs_context.list)); 
          Osal_MemCpy(ancs_context.list, &attrList[index+2], sizeof(ancs_context.list)-1);
          ancs_context.list[sizeof(ancs_context.list)-1] = '\0';
        }
        
        index += 2 + len; /* 2 Bytes Length of AttributeID x Value + Value Length*/
        if (appId) 
        {
          if ((len+1) <= MAX_DISPLAY_NAME_LEN) 
          {
            Osal_MemCpy(ancs_context.AppIdentifier, ancs_context.list, len+1);
            ancs_context.AppIdentifierLength = len + 1;
          } else {
            Osal_MemCpy(ancs_context.AppIdentifier, ancs_context.list, MAX_DISPLAY_NAME_LEN);
            ancs_context.AppIdentifierLength = MAX_DISPLAY_NAME_LEN;
          }
		  
          ancs_context.state = ANCS_GET_APP_ATTRIBUTE;  /* 3.2 Get APP Attributes (Detail Infomation about the App, Now only support to Get Name of App) */
          appId = FALSE;
        }
        
        if (len > 0)
          printf(" %s\r\n", ancs_context.list);
      }
    }// while

    if(ancs_context.state == ANCS_GET_APP_ATTRIBUTE)
    {
      APP_DBG_MSG(" 3.2 Get APP Attributes (Detail Infomation about the App, Now only support to Get Name of App) => ANCS_GET_APP_ATTRIBUTE \n\r"); 
    }
    else
    {
      /* Note, there is no  AppIdentifier, so we only perform active action, but you also can perform negtive action */
      if( (PositiveActionLabel == TRUE) || (NegativeActionLabel == TRUE) )
      {
        ancs_context.state = ANCS_PERFORM_NOTIFICATION_ACTION;  /* 3.2 Perform Notification Action */
        APP_DBG_MSG(" 3.2 Perform Notification Action => ANCS_PERFORM_NOTIFICATION_ACTION \n\r"); 
      }
      else
      {
        ancs_context.state = ANCS_IDLE;  /* 3.2 Perform Notification Action */
        APP_DBG_MSG(" No AppIdentifier & PositiveActionLabel &  NegativeActionLabel ==>  ANCS_IDLE \n\r"); 
      }	
    } 
  }// commandID
}

/**
* Parser of response for Get App Attributes command
* number of received attributes and attributes list input
*/ 
static void ANCS_Parse_GetAppAttr_Resp(uint8_t  commandID, uint16_t attrLen, uint8_t  *attrList)
{
  uint8_t appId;
  uint16_t len, index;

  index = 0;
  if(commandID == CommandIDGetAppAttributes)
  {
    /* loop on number of attribute IDs */
    while (index < attrLen) 
    {
      /* attrList[index+0] corresponding to AttributeID x*/
      Osal_MemCpy(&len, &attrList[index+1], 2); /* AttributeID x Value Length */
      if (len == 0)  /* Empty */
      {
        index += 3;
      } 
      else 
      {
        /* AttributeID x */
          ANCS_Show_AppAttr((AppAttributeID)attrList[index]); /* App AttributeID x */
        
        /* AttributeID for Application identifier */
        if (attrList[index] == AppAttributeIDDisplayName) 
        {
          appId = TRUE;
        } else {
          appId = FALSE;
        }
        
        /* AttributeID x Value */
        index++;
        if (len <= sizeof(ancs_context.list)) 
        {
          Osal_MemCpy(ancs_context.list, &attrList[index+2], len);
          ancs_context.list[len] = '\0';
        } 
        else 
        {
          APP_DBG_MSG("cut the AttributeID x Value len=%d <= sizeof(ancs_context.list)=%d \n\r",len,sizeof(ancs_context.list)); 
          Osal_MemCpy(ancs_context.list, &attrList[index+2], sizeof(ancs_context.list)-1);
          ancs_context.list[sizeof(ancs_context.list)-1] = '\0';
        }
        
        index += 2 + len; /* 2 Bytes Length of AttributeID x Value + Value Length*/
        if (appId) 
        {
          if ((len+1) <= MAX_DISPLAY_NAME_LEN) 
          {
            Osal_MemCpy(ancs_context.appDisplayName, ancs_context.list, len+1);
            ancs_context.appDisplayName_len = len + 1;
          } else {
            Osal_MemCpy(ancs_context.appDisplayName, ancs_context.list, MAX_DISPLAY_NAME_LEN);
            ancs_context.appDisplayName_len = MAX_DISPLAY_NAME_LEN;
          }
        } // appId
        
        if (len > 0)
          printf(" %s\r\n", ancs_context.list);
      }
    }// while

    if( (ancs_context.notifyList[ancs_context.notifyEntry].catID == CategoryIDIncomingCall) ||
    (ancs_context.notifyList[ancs_context.notifyEntry].catID == CategoryIDSchedule) ) /* depends on different Category */
    /* if( ((ancs_context.notifyList[ancs_context.notifyEntry].evFlag & EventFlagPositiveAction) == EventFlagPositiveAction) ||
    ((ancs_context.notifyList[ancs_context.notifyEntry].evFlag & EventFlagNegativeAction) == EventFlagNegativeAction) )*//* depends on action type */
    {
      ancs_context.genericFlag = TRUE;
      ancs_context.state = ANCS_PERFORM_NOTIFICATION_ACTION; /* 3.4 Perform Notification Action */
      APP_DBG_MSG(" 3.4 Perform Notification Action => ANCS_PERFORM_NOTIFICATION_ACTION \n\r"); 
    } else {
      APP_DBG_MSG("CommandIDGetAppAttributes notifyEntry=%d Removed\n\r", ancs_context.notifyEntry);
      ancs_context.notifyList[ancs_context.notifyEntry].used = FALSE;
      ancs_context.state = ANCS_CHECK_NOTIFICATION;
    }	
  }// commandID
}
/**
* Parser of ANCS Notification Source characteristic received 
* to fill ancs_context.notifyList elements
*/ 
static void ANCS_Notification_Source_Received_event(
                                             EventID evID,
                                             EventFlags evFlag,
                                             CategoryID catID,
                                             uint8_t catCount,
                                             uint32_t notifUID)
{
  uint16_t i;
  
  printf("*************** Notification Source Basic Infomation Received **********************\r\n");
  ANCS_Show_EventID(evID);
  ANCS_Show_EventFlag(evFlag);
  ANCS_Show_CategoryID(catID);
  printf("** CategoryCount: %d \r\n", catCount);
  printf("** NotificationUID: 0x%08x \r\n", notifUID);

  //ancs_context.notifyEntry = INVALID_NOTIFY_ENTRY;
  
  if (evID == EventIDNotificationRemoved) 
  {
    for (i=0; i < MAX_NMB_NOTIFY; i++) 
    {
      if (ancs_context.notifyList[i].notifUID == notifUID) 
      {
        ancs_context.notifyList[i].used = FALSE;
        printf("** notifyEntry: %d Removed\r\n", i);
        break;
      }
    }
  } 
  else 
  {
    for (i=0; i < MAX_NMB_NOTIFY; i++) 
    {
      if (!ancs_context.notifyList[i].used) 
      {
        ancs_context.notifyList[i].used = TRUE;
        ancs_context.notifyList[i].evID = evID;
        ancs_context.notifyList[i].evFlag = evFlag;
        ancs_context.notifyList[i].catID = catID;
        ancs_context.notifyList[i].catCount = catCount;
        ancs_context.notifyList[i].notifUID = notifUID;
        printf("** notifyEntry: %d Added\r\n", i);
        break;
      }
    }
  }
}

/**
* check event flag from ANCS Notification Source characteristic received 
* to fill ancs_context and filter silent event flags
*/ 
void ANCS_Notification_Check(EventFlags EventFlagMask)
{
  ancs_context.notifyEntry = INVALID_NOTIFY_ENTRY;
  for (uint8_t idx=0; idx<MAX_NMB_NOTIFY; idx++) 
  {
    if (ancs_context.notifyList[idx].used) 
    {
      
