STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
        ancs_context.GAPServiceStartHandle = ServiceStartHandle;
        ancs_context.GAPServiceEndHandle = ServiceEndHandle;
        
        APP_DBG_MSG("GAP_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == GENERIC_ATTRIBUTE_SERVICE_UUID) /* 0x1801 */ {
        
        ancs_context.GATTServiceStartHandle = ServiceStartHandle;
        ancs_context.GATTServiceEndHandle = ServiceEndHandle;
        
        APP_DBG_MSG("GENERIC_ATTRIBUTE_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
        /*******************************************************************************************************************/
      } else if (uuid == IMMEDIATE_ALERT_SERVICE_UUID) /* 0x1802 */ {
        APP_DBG_MSG("AMS_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == LINK_LOSS_SERVICE_UUID) /* 0x1803 */ {
        APP_DBG_MSG("LINK_LOSS_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == TX_POWER_SERVICE_UUID) /* 0x1804 */ {
        APP_DBG_MSG("TX_POWER_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == CURRENT_TIME_SERVICE_UUID) /* 0x1805 */ {
        APP_DBG_MSG("CURRENT_TIME_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == REFERENCE_UPDATE_TIME_SERVICE_UUID) /* 0x1806 */ {
        APP_DBG_MSG("REFERENCE_UPDATE_TIME_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == NEXT_DST_CHANGE_SERVICE_UUID) /* 0x1807 */ {
        APP_DBG_MSG("NEXT_DST_CHANGE_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == GLUCOSE_SERVICE_UUID) /* 0x1808 */ {
        APP_DBG_MSG("GLUCOSE_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == HEALTH_THERMOMETER_SERVICE_UUID) /* 0x1809 */ {
        APP_DBG_MSG("HEALTH_THERMOMETER_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == DEVICE_INFORMATION_SERVICE_UUID) /* 0x180A */ {
        APP_DBG_MSG("DEVICE_INFORMATION_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == 0x180B) /* 0x180B */ {
        APP_DBG_MSG("Unkown UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == 0x180C) /* 0x180C */ {
        APP_DBG_MSG("Unkown UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == HEART_RATE_SERVICE_UUID) /* 0x180D */ {
        APP_DBG_MSG("AMS_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == PHONE_ALERT_SERVICE_UUID) /* 0x180E */ {
        APP_DBG_MSG("PHONE_ALERT_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == BATTERY_SERVICE_UUID) /* 0x180F */ {
        APP_DBG_MSG("BATTERY_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
        /*******************************************************************************************************************/
      } else if (uuid == ANCS_SERVICE_UUID) {
        
        ancs_context.ANCSServiceStartHandle = ServiceStartHandle;
        ancs_context.ANCSServiceEndHandle = ServiceEndHandle;
        
        APP_DBG_MSG("ANCS_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else if (uuid == AMS_SERVICE_UUID) {
        APP_DBG_MSG("AMS_SERVICE_UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      } else {
        APP_DBG_MSG("invalid UUID=0x%04X found [%04X %04X]!\n",uuid,ServiceStartHandle,ServiceEndHandle);
      }
      
      uuid_offset += pr->Attribute_Data_Length;
    }//numServ
  }
  else
  {
    APP_DBG_MSG("EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP, failed no free index in connection table !\n\r");
  }
}

/**
* function of GATT characteristics parse
*/
static void GattParseChars(aci_att_read_by_type_resp_event_rp0 *pr)
{
  uint16_t uuid,CharStartHandle,CharValueHandle;
  uint8_t uuid_offset,uuid_size,uuid_short_offset;
  uint8_t i,idx,numHdleValuePair;
  uint8_t CharProperties;

  APP_DBG_MSG("EVT_BLUE_ATT_READ_BY_TYPE_RESP - Connection_Handle=0x%x,Handle_Value_Pair_Length=%d,Data_Length=%d\n\r",
	  pr->Connection_Handle,
	  pr->Handle_Value_Pair_Length,
	  pr->Data_Length);

  if (ancs_context.connection_handle == pr->Connection_Handle)
  {
    /* event data in Attribute_Data_List contains:
    * 2 bytes for start handle
    * 1 byte char properties
    * 2 bytes handle
    * 2 or 16 bytes data for UUID
    */            
    
    /* Number of attribute value tuples */
    numHdleValuePair = pr->Data_Length / pr->Handle_Value_Pair_Length;
	
    if (pr->Handle_Value_Pair_Length == 21) /* we are interested in  128 bit UUIDs */
    {
      idx = 17;                /*UUID index of 2 bytes read part in Attribute_Data_List */
      uuid_offset = 5;         /*UUID offset in bytes in Attribute_Data_List */
      uuid_size = 16;          /*UUID size in bytes */
      uuid_short_offset = 12;  /*UUID offset of 2 bytes read part in UUID field*/
    }
    if (pr->Handle_Value_Pair_Length == 7) /* we are interested in  16 bit UUIDs */
    {
      idx = 5;
      uuid_offset = 5;
      uuid_size = 2;
      uuid_short_offset = 0;
    }
    UNUSED(idx);
    UNUSED(uuid_size);
	
    pr->Data_Length -= 1;
	  
    /* Loop on number of attribute value tuples */      
    for (i = 0; i < numHdleValuePair; i++)
    {
      CharStartHandle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[uuid_offset-5]);
      CharProperties = pr->Handle_Value_Pair_Data[uuid_offset-3];
      CharValueHandle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[uuid_offset-2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[uuid_offset+uuid_short_offset]);
    
      if ( (uuid != 0x0) && (CharProperties != 0x0) && (CharStartHandle != 0x0) && (CharValueHandle !=0) )
      {
        APP_DBG_MSG("-- GATT : numHdleValuePair=%d,short UUID=0x%04X FOUND CharProperties=0x%04X CharHandle [0x%04X - 0x%04X]\n", 
        i, uuid, CharProperties, CharStartHandle,CharValueHandle);
                
        /* complete ancs_context fields */
        if (uuid == DEVICE_NAME_UUID) /* 0x2A00 */ {
          APP_DBG_MSG("GAP DEVICE_NAME_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == APPEARANCE_UUID) /* 0x2A01 */ {
          APP_DBG_MSG("GAP APPEARANCE_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == PERIPHERAL_PRIVACY_FLAG_UUID) /* 0x2A02 */ {
          APP_DBG_MSG("GAP PERIPHERAL_PRIVACY_FLAG_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == RECONNECTION_ADDR_UUID) /* 0x2A03 */ {
          APP_DBG_MSG("GAP APPEARANCE_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == PERIPHERAL_PREFERRED_CONN_PARAMS_UUID) /* 0x2A04 */ {
          APP_DBG_MSG("GAP APPEARANCE_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
          /*******************************************************************************************************************/
        }else if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID) /* 0x2A05 */ {
        
          ancs_context.ServiceChangedCharStartHdle = CharStartHandle;
          ancs_context.ServiceChangedCharValueHdle = CharValueHandle;
          APP_DBG_MSG("GATT SERVICE_CHANGED_CHARACTERISTIC_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        /*******************************************************************************************************************/
        } else if (uuid == BATTERY_LEVEL_CHAR_UUID) /* 0x2A19 */ {
          APP_DBG_MSG("BATTERY_LEVEL_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
          /*******************************************************************************************************************/
        } else if (uuid == CURRENT_TIME_CHAR_UUID) /* 0x2A2B */ {
          APP_DBG_MSG("CURRENT_TIME_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == LOCAL_TIME_INFORMATION_CHAR_UUID) /* 0x2A0F */ {
          APP_DBG_MSG("LOCAL_TIME_INFORMATION_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
          /*******************************************************************************************************************/
        } else if (uuid == MANUFACTURER_NAME_UUID) /* 0x2A29 */ {
          APP_DBG_MSG("DeviceInformationService MANUFACTURER_NAME_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == MODEL_NUMBER_UUID) /* 0x2A24 */ {
          APP_DBG_MSG("DeviceInformationService MODEL_NUMBER_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
          /*******************************************************************************************************************/
        } else if (uuid == ANCS_NOTIFICATION_SOURCE_CHAR_UUID) {
        
          ancs_context.ANCSNotificationSourceCharStartHdle = CharStartHandle;
          ancs_context.ANCSNotificationSourceCharValueHdle = CharValueHandle;
          
          APP_DBG_MSG("ANCS_NOTIFICATION_SOURCE_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == ANCS_CONTROL_POINT_CHAR_UUID) {
          
          ancs_context.ANCSControlPointCharStartHdle = CharStartHandle;
          ancs_context.ANCSControlPointCharValueHdle = CharValueHandle;
          
