STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
          APP_DBG_MSG("ANCS_CONTROL_POINT_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else if (uuid == ANCS_DATA_SOURCE_CHAR_UUID) {
          
          ancs_context.ANCSDataSourceCharStartHdle = CharStartHandle;
          ancs_context.ANCSDataSourceCharValueHdle = CharValueHandle;
          
          APP_DBG_MSG("ANCS_DATA_SOURCE_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        
        } else if (uuid == CENTRAL_ADDRESS_RESOLUTION_UUID) {
          
          ancs_context.GAPCentralAddressResolutionCharStartHdle = CharStartHandle;
          ancs_context.GAPCentralAddressResolutionCharValueHdle = CharValueHandle;
          
          APP_DBG_MSG("CENTRAL_ADDRESS_RESOLUTION_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        } else {
          APP_DBG_MSG("Unknown_char UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
        }
      
      }
      uuid_offset += pr->Handle_Value_Pair_Length;
    }// numHdleValuePair
  }
  else
    APP_DBG_MSG("EVT_BLUE_ATT_READ_BY_TYPE_RESP, failed handle not found in connection table !\n\r");
}
/**
* function of GATT descriptor parse
*/
static void GattParseDescs(aci_att_find_info_resp_event_rp0 *pr)
{
  uint16_t uuid,handle;
  uint8_t uuid_offset,uuid_size,uuid_short_offset;
  uint8_t i,numDesc,handle_uuid_pair_size;

  APP_DBG_MSG("EVT_BLUE_ATT_FIND_INFORMATION_RESP - Connection_Handle=0x%x,Format=%d,Event_Data_Length=%d\n\r",
	  pr->Connection_Handle,
	  pr->Format,
	  pr->Event_Data_Length);

  if (ancs_context.connection_handle == pr->Connection_Handle)
  {
    /* event data in Attribute_Data_List contains:
    * 2 bytes handle
    * 2 or 16 bytes data for UUID
    */              
    if (pr->Format == UUID_TYPE_16)
    {
      uuid_size = 2;
      uuid_offset = 2;
      uuid_short_offset = 0;
      handle_uuid_pair_size = 4;
    }
    if (pr->Format == UUID_TYPE_128)
    {
      uuid_size = 16;
      uuid_offset = 2;
      uuid_short_offset = 12;
      handle_uuid_pair_size = 18;
    }
    UNUSED(uuid_size);
    
    /* Number of handle uuid pairs */            
    numDesc = (pr->Event_Data_Length) / handle_uuid_pair_size;
  
    for (i = 0; i < numDesc; i++)
    {
      handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[uuid_offset-2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[uuid_offset+uuid_short_offset]);
      
      /* 1. primary serice handle + primary serice UUID */
      if(uuid == PRIMARY_SERVICE_UUID)
      {
      APP_DBG_MSG("PRIMARY_SERVICE_UUID=0x%04X handle=0x%04X\n\r",uuid,handle);
      }/* 1. primary serice handle + primary serice UUID */
    
      /* 2. char handle + char UUID */
      else if(uuid == CHARACTERISTIC_UUID)
      {
      /* reset UUID & handle */
      gCharUUID = 0;
      gCharStartHandle = 0;
      gCharValueHandle = 0;
      gCharDescriptorHandle = 0;
      
      gCharStartHandle = handle;
      APP_DBG_MSG("reset CHARACTERISTIC_UUID=0x%04X CharStartHandle=0x%04X\n\r",uuid,handle);
      }/* 2. char handle + char UUID */
      
      /* 3. char desc handle + char desc UUID */
      else if( (uuid == CHAR_EXTENDED_PROPERTIES_DESCRIPTOR_UUID) /* 0x2900 */
             || (uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID) )/* 0x2902 */
      {
      gCharDescriptorHandle = handle;
      if	(gCharValueHandle == ancs_context.ServiceChangedCharValueHdle){
        
          ancs_context.ServiceChangedCharDescHdle = handle;
          APP_DBG_MSG("uuid=0x%04X handle=0x%04X-0x%04X-0x%04X\n\r\n\r", uuid,gCharStartHandle,gCharValueHandle,handle);
        } else if	(gCharValueHandle == ancs_context.ANCSNotificationSourceCharValueHdle){
        
          ancs_context.ANCSNotificationSourceCharDescHdle = handle;
          APP_DBG_MSG("uuid=0x%04X handle=0x%04X-0x%04X-0x%04X\n\r\n\r", uuid,gCharStartHandle,gCharValueHandle,handle);
        } else if	(gCharValueHandle == ancs_context.ANCSDataSourceCharValueHdle){
        
          ancs_context.ANCSDataSourceCharDescHdle = handle;
          APP_DBG_MSG("uuid=0x%04X handle=0x%04X-0x%04X-0x%04X\n\r\n\r", uuid,gCharStartHandle,gCharValueHandle,handle);
        } else if  (gCharValueHandle == ancs_context.ANCSControlPointCharValueHdle){
        
          ancs_context.ANCSControlPointCharDescHdle = handle;
          APP_DBG_MSG("uuid=0x%04X handle=0x%04X-0x%04X-0x%04X\n\r\n\r", uuid,gCharStartHandle,gCharValueHandle,handle);
        } else {
          APP_DBG_MSG(" unkown_char_desc UUID=0x%04X handle=0x%04X-0x%04X-0x%04X \n\r",uuid,gCharStartHandle,gCharValueHandle,handle);
        }
      }// 3. char desc handle + char desc UUID
      
      /* 4. char value handle + char UUID */
      else
      {
        gCharUUID = uuid;
        gCharValueHandle = handle;
        if (uuid == DEVICE_NAME_UUID) /* 0x2A00 */ {
          APP_DBG_MSG("GAP DEVICE_NAME_UUID=0x%04X found [%04X]!\n",uuid,handle);
        } else if (uuid == APPEARANCE_UUID) /* 0x2A01 */ {
          APP_DBG_MSG("GAP APPEARANCE_UUID=0x%04X found [%04X]!\n",uuid,handle);
        } else if (uuid == PERIPHERAL_PRIVACY_FLAG_UUID) /* 0x2A02 */ {
          APP_DBG_MSG("GAP PERIPHERAL_PRIVACY_FLAG_UUID=0x%04X found [%04X]!\n",uuid,handle);
        } else if (uuid == RECONNECTION_ADDR_UUID) /* 0x2A03 */ {
          APP_DBG_MSG("GAP APPEARANCE_UUID=0x%04X found [%04X]!\n",uuid,handle);
        } else if (uuid == PERIPHERAL_PREFERRED_CONN_PARAMS_UUID) /* 0x2A04 */ {
          APP_DBG_MSG("GAP APPEARANCE_UUID=0x%04X found [%04X]!\n",uuid,handle);
          /*******************************************************************************************************************/
        } else if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID) /* 0x2A05 */ {
          APP_DBG_MSG(" SERVICE_CHANGED_CHARACTERISTIC_UUID=0x%04X CharValueHandle [%04X]\n",uuid,handle);
          /*******************************************************************************************************************/
        } else if (uuid == BATTERY_LEVEL_CHAR_UUID) /* 0x2A19 */ {
          APP_DBG_MSG("BATTERY_LEVEL_CHAR_UUID=0x%04X found [%04X]!\n",uuid,handle);
          /*******************************************************************************************************************/
        } else if (uuid == CURRENT_TIME_CHAR_UUID) /* 0x2A2B */ {
          APP_DBG_MSG("CURRENT_TIME_CHAR_UUID=0x%04X found [%04X]!\n",uuid,handle);
        } else if (uuid == LOCAL_TIME_INFORMATION_CHAR_UUID) /* 0x2A0F */ {
          APP_DBG_MSG("LOCAL_TIME_INFORMATION_CHAR_UUID=0x%04X found [%04X]!\n",uuid,handle);
          /*******************************************************************************************************************/
        } else if (uuid == MANUFACTURER_NAME_UUID) /* 0x2A29 */ {
          APP_DBG_MSG("DeviceInformationService MANUFACTURER_NAME_UUID=0x%04X found [%04X]!\n",uuid,handle);
        } else if (uuid == MODEL_NUMBER_UUID) /* 0x2A24 */ {
          APP_DBG_MSG("DeviceInformationService MODEL_NUMBER_UUID=0x%04X found [%04X]!\n",uuid,handle);
          /*******************************************************************************************************************/
        } else if (uuid == ANCS_NOTIFICATION_SOURCE_CHAR_UUID) {
          APP_DBG_MSG(" ANCS_NOTIFICATION_SOURCE_CHAR_UUID=0x%04X CharValueHandle [%04X]!\n",uuid,handle);
        } else if (uuid == ANCS_CONTROL_POINT_CHAR_UUID) {
          APP_DBG_MSG("  ANCS_CONTROL_POINT_CHAR_UUID=0x%04X CharValueHandle [%04X]!\n",uuid,handle);
        } else if (uuid == ANCS_DATA_SOURCE_CHAR_UUID) {
          APP_DBG_MSG(" ANCS_DATA_SOURCE_CHAR_UUID=0x%04X CharValueHandle [%04X]!\n",uuid,handle);
        } else if (uuid == CENTRAL_ADDRESS_RESOLUTION_UUID) {
          APP_DBG_MSG("  CENTRAL_ADDRESS_RESOLUTION_UUID=0x%04X CharValueHandle [%04X]!\n",uuid,handle);
        } else {
          APP_DBG_MSG(" invalid char value UUID=0x%04X CharValueHandle [%04X]!\n",uuid,handle);
        }
      }// 4. char value handle + char UUID
    
    uuid_offset += handle_uuid_pair_size;
    }
  }
  else
    APP_DBG_MSG("EVT_BLUE_ATT_FIND_INFORMATION_RESP, failed handle not found in connection table !\n\r");
}

static void GattParseNotification(aci_gatt_notification_event_rp0 *pr)
{
  APP_DBG_MSG("EVT_BLUE_GATT_NOTIFICATION - Connection_Handle=0x%x,Attribute_Handle=0x%04X,Attribute_Value_Length=%d\n\r",
	  pr->Connection_Handle,
	  pr->Attribute_Handle,
	  pr->Attribute_Value_Length);

  if (ancs_context.connection_handle == pr->Connection_Handle)
  {
	// 1. Incomming Nofification
    if (pr->Attribute_Handle == ancs_context.ANCSNotificationSourceCharValueHdle) 
    {
      APP_DBG_MSG("1. Incomming Nofification received BASIC information : \n\r");
      EventID evID       = (EventID)pr->Attribute_Value[0];
      EventFlags evFlag = (EventFlags)pr->Attribute_Value[1];
      CategoryID catID  = (CategoryID)pr->Attribute_Value[2];
      uint8_t catCount   = pr->Attribute_Value[3];
      uint32_t notifUID   = (uint32_t)(*((uint32_t *)&pr->Attribute_Value[4]));
      ANCS_Notification_Source_Received_event(evID, evFlag, catID, catCount, notifUID);
    
      // 2. Get More Detail Infomations
      if( (evID == EventIDNotificationAdded) )
      {
        if((evFlag & EventFlagSilent) != EventFlagSilent)
        {
        ANCS_Notification_Check(evFlag);
        Ancs_Mgr();
        }
      }
    }// ANCSNotificationSourceCharValueHdle

