STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
    // 3. Parse Detail Infomations, Perform Notification Action or Get APP Attributes
    if (pr->Attribute_Handle == ancs_context.ANCSDataSourceCharValueHdle) 
    { 
      CommandID cmdID	= (CommandID)pr->Attribute_Value[0];
      uint32_t notifUID	= (uint32_t)0x00000000;
      
      uint16_t AttributeLength;
      uint8_t *AttributeList;
      
      char AppIdentifier[128]={0};
      uint16_t AppIdentifierLength;

      /***********************************************************************************/
      if (cmdID == CommandIDGetNotificationAttributes)
      {
        APP_DBG_MSG("3.1 Parse Detail Infomation of Notification Attribute, CommandIDGetNotificationAttributes Response: \n\r");
        notifUID = (uint32_t)(*((uint32_t *)&pr->Attribute_Value[1]));
        AttributeLength = pr->Attribute_Value_Length - (1+4);
        AttributeList = (uint8_t *)&pr->Attribute_Value[1+4];
        
        // 3.1 Parse Detail Infomation of Notification Attribute
        ANCS_Parse_GetNotificationAttr_Resp(cmdID,AttributeLength,AttributeList);
      }
      UNUSED(notifUID);
	  
      if (cmdID == CommandIDGetAppAttributes)
      {
        APP_DBG_MSG("3.3 Parse Detail Infomation of APP Attribute, CommandIDGetAppAttributes Response: \n\r");
        strcpy(AppIdentifier,(char *)&pr->Attribute_Value[1]);
        AppIdentifierLength = strlen((char *)&pr->Attribute_Value[1]);
        AttributeLength = pr->Attribute_Value_Length - (1+AppIdentifierLength+1);
        AttributeList = (uint8_t *)&pr->Attribute_Value[1+AppIdentifierLength+1];
        
        // 3.3 Parse Detail Infomation of App Attribute
        ANCS_Parse_GetAppAttr_Resp(cmdID,AttributeLength,AttributeList);
      }
      
      Ancs_Mgr();
      /***********************************************************************************/
    }/* ANCSDataSourceCharValueHdle */           
  }
  else
    APP_DBG_MSG("EVT_BLUE_GATT_NOTIFICATION, failed handle not found in connection table !\n\r");
}

/**
 * @brief  ANCS Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t ANCS_Client_Event_Handler( void *Event )
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt * event_pckt;
  evt_blue_aci * blue_evt;
  Connection_Context_t Notification;

  return_value = SVCCTL_EvtAckFlowEnable;
  event_pckt = (hci_event_pckt *) (((hci_uart_pckt*) Event)->data);

  switch (event_pckt->evt)
  {
    case EVT_VENDOR:
    {
      blue_evt = (evt_blue_aci*) event_pckt->data;
      switch (blue_evt->ecode)
      {  
        case EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP:
        {
          aci_att_read_by_group_type_resp_event_rp0 *pr = (void*) blue_evt->data;
          
          APP_DBG_MSG(" EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP\n");
          GattParseServices((aci_att_read_by_group_type_resp_event_rp0 *)pr);
        }
          break;
        case EVT_BLUE_ATT_READ_BY_TYPE_RESP:
        {
          aci_att_read_by_type_resp_event_rp0 *pr = (void*) blue_evt->data;
          APP_DBG_MSG(" EVT_BLUE_ATT_READ_BY_TYPE_RESP\n");
          GattParseChars((aci_att_read_by_type_resp_event_rp0 *)pr);
        }
          break;
        case EVT_BLUE_ATT_FIND_INFORMATION_RESP:
        {
          aci_att_find_info_resp_event_rp0 *pr = (void*) blue_evt->data;
          APP_DBG_MSG(" EVT_BLUE_ATT_FIND_INFORMATION_RESP\n");
          GattParseDescs((aci_att_find_info_resp_event_rp0 *)pr);
        }
          break; /*EVT_BLUE_ATT_FIND_INFORMATION_RESP*/

        case EVT_BLUE_GATT_DISC_READ_CHAR_BY_UUID_RESP:
        {
          APP_DBG_MSG(" EVT_BLUE_GATT_DISC_READ_CHAR_BY_UUID_RESP\n");
        }
        break;
		
        case EVT_BLUE_ATT_FIND_BY_TYPE_VAL_RESP:
        {
          aci_att_find_by_type_value_resp_event_rp0 *pr = (void*) blue_evt->data;
          APP_DBG_MSG(" EVT_BLUE_ATT_FIND_BY_TYPE_VAL_RESP\n");
          GattParseServicesByUUID((aci_att_find_by_type_value_resp_event_rp0 *)pr); 
        }
        break;
		
        case EVT_BLUE_GATT_NOTIFICATION:
        {
          aci_gatt_notification_event_rp0 *pr = (void*) blue_evt->data;
          GattParseNotification((aci_gatt_notification_event_rp0 *)pr);
        }
          break;/* end EVT_BLUE_GATT_NOTIFICATION */

        case EVT_BLUE_GATT_ATTRIBUTE_MODIFIED:
        {
          aci_gatt_attribute_modified_event_rp0 *attribute_modified = (aci_gatt_attribute_modified_event_rp0*) blue_evt->data;
          APP_DBG_MSG("EVT_BLUE_GATT_ATTRIBUTE_MODIFIED Attr_Handle=0x%04X Offset=0x%04X Attr_Data_Length=0x%04X \n\r",
		  	attribute_modified->Attr_Handle,
		  	attribute_modified->Offset,
		  	attribute_modified->Attr_Data_Length);
        }/* end EVT_BLUE_GATT_ATTRIBUTE_MODIFIED */
        break;

        case EVT_BLUE_ATT_EXCHANGE_MTU_RESP:
        {
          aci_att_exchange_mtu_resp_event_rp0 * exchange_mtu_resp;
          exchange_mtu_resp = (aci_att_exchange_mtu_resp_event_rp0 *)blue_evt->data;
          APP_DBG_MSG("EVT_BLUE_ATT_EXCHANGE_MTU_RESP Connection_Handle=0x%04X Server_RX_MTU = %d ==> ANCS_MTU_EXCHANGE_COMPLETE \n",
          exchange_mtu_resp->Connection_Handle,
          exchange_mtu_resp->Server_RX_MTU );
          
          Notification.Evt_Opcode = ANCS_MTU_EXCHANGE_COMPLETE;
          Notification.connection_handle = exchange_mtu_resp->Connection_Handle;
          ANCS_App_Notification(&Notification);
        }
        break;

        case EVT_BLUE_GATT_PROCEDURE_COMPLETE:
        {
          aci_gatt_proc_complete_event_rp0 *pr = (void*) blue_evt->data;
          if(pr->Error_Code != ERR_CMD_SUCCESS)
          {
            APP_DBG_MSG("EVT_BLUE_GATT_PROCEDURE_COMPLETE - Connection_Handle=0x%04x,Error_Code=0x%02X (0x41: Failed)\n\r", pr->Connection_Handle,pr->Error_Code);
          }
          
          if (ancs_context.connection_handle == pr->Connection_Handle)
          {
            gatt_cmd_resp_release(0);
          }
          else
            APP_DBG_MSG("EVT_BLUE_GATT_PROCEDURE_COMPLETE, failed handle not found in connection table !\n\r");
        }/*EVT_BLUE_GATT_PROCEDURE_COMPLETE*/
        break;
        case EVT_BLUE_GATT_ERROR_RESP:
        {
          aci_gatt_error_resp_event_rp0 *error_resp= (void*) blue_evt->data;
          APP_DBG_MSG("EVT_BLUE_GATT_ERROR_RESP Connection_Handle=0x%04X Req_Opcode=0x%02X Attribute_Handle=0x%04X Error_Code=0x%02X (0x05: Insufficient authentication,0x0A: Attribute not found)\n",
		  	error_resp->Connection_Handle,error_resp->Req_Opcode,error_resp->Attribute_Handle,error_resp->Error_Code);
        }/*EVT_BLUE_GATT_ERROR_RESP*/
        break;
		  
        default:
  	  	APP_DBG_MSG("invalid ecode 0x%04X\n",blue_evt->ecode);
		return_value = SVCCTL_EvtNotAck;
        break;
      }
    } 
    break; /* EVT_VENDOR */

    default:
      return_value = SVCCTL_EvtNotAck;
    break;
  }

  return (return_value);
}/* end BLE_CTRL_Event_Acknowledged_Status_t */

void ANCS_App_KeyButton1Action(void)
{
   APP_DBG_MSG("\n\r ** Term CONNECTION **  \n\r");
   aci_gap_terminate(ancs_context.connection_handle, 0x13);
}
void ANCS_App_KeyButton2Action(void)
{
  APP_DBG_MSG("Review the PreExisted Notification \n\r");
  Connection_Context_t Notification;
  Notification.Evt_Opcode = ANCS_CHECK_NOTIFICATION;
  Notification.connection_handle = ancs_context.connection_handle;
  ANCS_App_Notification(&Notification);
}
void ANCS_App_KeyButton3Action(void)
{
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device & aci_gap_terminate \n\r");
  aci_gap_remove_bonded_device(ancs_context.Peer_Address_Type,ancs_context.Peer_Address);
  aci_gap_clear_security_db();
  aci_gap_terminate(ancs_context.connection_handle, 0x13);
}

