STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
#if (GET_ACTION_ID_FROM_UART == 1)
static uint8_t ANCS_App_Get_Char(void)
{
  uint8_t ch;
  HAL_UART_Receive(&huart1, (uint8_t*)&ch, 1,HAL_MAX_DELAY);
  
  /* Echo character back to console */
  HAL_UART_Transmit_DMA(&huart1, (uint8_t*)&ch, 1);

  /* And cope with Windows */
  if(ch == '\r'){
    uint8_t ret = '\n';
    HAL_UART_Transmit_DMA(&huart1, (uint8_t*)&ret, 1);
  }

  return ch;
}
#endif

static ActionID ANCS_App_Get_ActionID(void)
{
  ActionID actID = ActionIDPositive;
  
  #if (GET_ACTION_ID_FROM_UART == 1)
  uint8_t performAction;
  uint32_t StartTime = HAL_GetTick();
  uint32_t ActionTimeout = 5000;
  
  APP_DBG_MSG("** Notification Action. Press on the keyboard: A=Accept or R=Reject\r\n");
  APP_DBG_MSG("** Waiting 5 sec....\r\n");
  
  performAction = ANCS_App_Get_Char();
  
  if ((HAL_GetTick() - StartTime) >= ActionTimeout) {
    APP_DBG_MSG("** Action Timeout\r\n");
  }
  else
  {
    if ((performAction == 'A') || (performAction == 'a')) {
      actID = ActionIDPositive;
      APP_DBG_MSG("** Positive Action %c \n\r",performAction);
    }else if ((performAction == 'R') || (performAction == 'r')) {
      actID = ActionIDNegative;
      APP_DBG_MSG("** Reject Action %c \n\r",performAction);
    }
  }
  #endif

  return actID;
}
void ANCS_App_Remove_Bonding_Info(void)
{
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device \n\r");
  aci_gap_remove_bonded_device(ancs_context.Peer_Address_Type,ancs_context.Peer_Address);
  aci_gap_clear_security_db();
}

void ANCS_App_Peer_Bonded_Check(uint16_t Connection_Handle, uint8_t Peer_Address_Type, uint8_t Peer_Address[6])
{
  tBleStatus result = BLE_STATUS_SUCCESS;

  ancs_context.connection_handle = Connection_Handle;
  
  ancs_context.Peer_Address_Type = Peer_Address_Type;
  ancs_context.Peer_Address[5] = Peer_Address[5];
  ancs_context.Peer_Address[4] = Peer_Address[4];
  ancs_context.Peer_Address[3] = Peer_Address[3];
  ancs_context.Peer_Address[2] = Peer_Address[2];
  ancs_context.Peer_Address[1] = Peer_Address[1];
  ancs_context.Peer_Address[0] = Peer_Address[0];
          
  result = aci_gap_is_device_bonded(ancs_context.Peer_Address_Type,ancs_context.Peer_Address);
  if (result == BLE_STATUS_SUCCESS)
  {
    ancs_context.Peer_Bonded = 0x01;
  }
  else 
  {
    ancs_context.Peer_Bonded = 0x00;
  }
  
  uint8_t Security_Mode, Security_Level;
  
  result = aci_gap_get_security_level(ancs_context.connection_handle,&Security_Mode,&Security_Level);
  ancs_context.Security_Mode = Security_Mode;
  ancs_context.Security_Level = Security_Level;
  if (result == BLE_STATUS_SUCCESS)
  {
  APP_DBG_MSG("Peer_Bonded=%d Security_Mode= %d, Security_Level= %d \n\r", ancs_context.Peer_Bonded, Security_Mode, Security_Level);
  }
	
}

void ANCS_App_Update_Service( )
{
  switch(ancs_context.state)
  {
    case ANCS_NUMERIC_COMPARISON_VALUE_CONFIRM:
    {
      GapProcReq(GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM);
    }
    break;
	
    case ANCS_ALLOW_REBOND:
    {
      GapProcReq(GAP_PROC_ALLOW_REBOND);
    }
    break;

    case ANCS_MTU_UPDATE:
    {
      GattProcReq(GATT_PROC_MTU_UPDATE);
    }
    break;
	
    case ANCS_DISCOVER_ANCS_SERVICE:
    {
      /* GattProcReq(GATT_PROC_MTU_UPDATE); */ /* enable it if you want to set ATT_MTU */
      GattProcReq(GATT_PROC_DISC_ANCS_SERVICE);
      GattProcReq(GATT_PROC_DISC_ALL_PRIMARY_SERVICES);
      GattProcReq(GATT_PROC_DISC_ALL_CHARS);
      GattProcReq(GATT_PROC_DISC_ALL_DESCS);
	  
      APP_DBG_MSG("Peer_Bonded=%d Security_Mode= %d, Security_Level= %d \n\r", ancs_context.Peer_Bonded, ancs_context.Security_Mode,ancs_context.Security_Level);
      if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
      {
        if( (ancs_context.Peer_Bonded == 0x00) ||
            ( (ancs_context.Peer_Bonded == 0x01) && (ancs_context.Security_Mode == 0x01) && (ancs_context.Security_Level == 0x01) )
          )
        {
          GapProcReq(GAP_PROC_SLAVE_SECURITY_REQ);
          
          APP_DBG_MSG("waiting for  EVT_BLUE_GAP_PAIRING_CMPLT \n\r");
          gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);/* waiting for EVT_BLUE_GAP_PAIRING_CMPLT */
          APP_DBG_MSG("waited for  EVT_BLUE_GAP_PAIRING_CMPLT \n\r");
        }
      }
		
      GattProcReq(GATT_PROC_ENABLE_ALL_NOTIFICATIONS);
    }
    break;

    
    case ANCS_GET_NOTIFICATION_ATTRIBUTE:
    {
      AncsProcReq(ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE);
    }
    break;
    
    case ANCS_GET_APP_ATTRIBUTE:
    {
      AncsProcReq(ANCS_PROC_GET_APP_ATTRIBUTE);
    }
    break;
    
    case ANCS_PERFORM_NOTIFICATION_ACTION:
    {
      AncsProcReq(ANCS_PROC_PERFORM_NOTIFICATION_ACTION);
    }
    break;

    default:
    {
      APP_DBG_MSG("invalid ancs_context.state=%d \n\r",ancs_context.state);
    }
    break;
  }
}

static void GapProcReq(GapProcId_t GapProcId)
{
  tBleStatus status;
  uint8_t Security_Mode, Security_Level;

  switch(GapProcId)
  {
    case GAP_PROC_SLAVE_SECURITY_REQ:
    {
      ancs_context.state = ANCS_SECURITY_REQUEST;
      status = aci_gap_get_security_level(ancs_context.connection_handle,&Security_Mode,&Security_Level);
      if (status == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("ANCS_SECURITY_REQUEST Security_Mode= %d, Security_Level= %d \n", Security_Mode, Security_Level);
        status = aci_gap_slave_security_req(ancs_context.connection_handle); 
        if (status != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("ANCS_SECURITY_REQUEST aci_gap_slave_security_req  status=0x%02x \n\r",status);
        }

         APP_DBG_MSG("ANCS_SECURITY_REQUEST waiting for EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED \n\r");
	  gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);/* waiting for EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED */
	  APP_DBG_MSG("ANCS_SECURITY_REQUEST waited for EVT_BLUE_GAP_SLAVE_SECURITY_INITIATED  \n\r");
      }   
    }
    break;

    case GAP_PROC_PASS_KEY_RESPONSE:
    {
      ancs_context.state = ANCS_PASS_KEY_RESPONSE;
      APP_DBG_MSG("ANCS_PASS_KEY_RESPONSE \n\r");
      aci_gap_pass_key_resp(ancs_context.connection_handle, CFG_FIXED_PIN);/* response for EVT_BLUE_GAP_PASS_KEY_REQUEST */
    }
    break;

    case GAP_PROC_ALLOW_REBOND:
    {
      ancs_context.state = ANCS_ALLOW_REBOND;
      APP_DBG_MSG("ANCS_ALLOW_REBOND aci_gap_allow_rebond(0x%04X)\n\r",ancs_context.connection_handle);
      aci_gap_allow_rebond(ancs_context.connection_handle);/* response for EVT_BLUE_GAP_BOND_LOST */
    }
    break;

    case GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM:
    {
      ancs_context.state = ANCS_NUMERIC_COMPARISON_VALUE_CONFIRM;   
      aci_gap_numeric_comparison_value_confirm_yesno(ancs_context.connection_handle, 1); /* CONFIRM_YES = 1 */
      
      APP_DBG_MSG("GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM ** aci_gap_numeric_comparison_value_confirm_yesno-->YES \n");
    }
    break;
		  
    case GAP_PROC_TERMINATE_CONNECTION:
    {
      APP_DBG_MSG("terminate connection \n");
      ancs_context.state = ANCS_DISCONNECTING;
      status = aci_gap_terminate(ancs_context.connection_handle,0x13);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Term Connection cmd failure: 0x%x\n", status);
      }
      gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);
      
      APP_DBG_MSG("GAP_PROC_TERMINATE_CONNECTION complete event received\n");
    }
    break;
	  
    default:
      break;
  }
  return;
}

static void GattProcReq(GattProcId_t GattProcId)
{
  tBleStatus result = BLE_STATUS_SUCCESS;

  switch (GattProcId)
  {
    case GATT_PROC_MTU_UPDATE:
    {
      ancs_context.state = ANCS_SET_DATA_LENGTH;
      result = hci_le_set_data_length(ancs_context.connection_handle,CFG_BLE_MAX_ATT_MTU,CFG_BLE_MAX_ATT_MTU_TX_TIME);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("ANCS_SET_DATA_LENGTH set data length %d %d ok ==>aci_gatt_exchange_config \n",CFG_BLE_MAX_ATT_MTU,CFG_BLE_MAX_ATT_MTU_TX_TIME);
        ancs_context.state = ANCS_MTU_UPDATE;
        result = aci_gatt_exchange_config(ancs_context.connection_handle);
        gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
        if (result == BLE_STATUS_SUCCESS)
        {
        APP_DBG_MSG("aci_gatt_exchange_config cmd ok \n\r");
        }
        else
        {
        APP_DBG_MSG("aci_gatt_exchange_config cmd KO result=0x%02x \n\r",result);
        }
      }
    }
    break; /* GATT_PROC_MTU_UPDATE */
	
    case GATT_PROC_DISC_ANCS_SERVICE:
    {
      ancs_context.state = ANCS_DISCOVER_ANCS_SERVICE;
      /* discover ancs service for discover notification source / data source / control point characteristic */
      UUID_t ancs_service_uuid;
      COPY_ANCS_SERVICE_UUID(ancs_service_uuid.UUID_128);
      result = aci_gatt_disc_primary_service_by_uuid(ancs_context.connection_handle,UUID_TYPE_128,(UUID_t *)&ancs_service_uuid);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("GATT_PROC_DISC_ANCS_SERVICE aci_gatt_disc_primary_service_by_uuid cmd ok\n");
      }
      else 
      {
        APP_DBG_MSG("GATT_PROC_DISC_ANCS_SERVICE aci_gatt_disc_primary_service_by_uuid cmd NOK status =0x%02X \n",result);
      }
	  
      gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
      if ( (ancs_context.ANCSServiceStartHandle == 0x0000) && (ancs_context.ANCSServiceEndHandle == 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ANCS_SERVICE ANCS Service is NOT found !!! ==> connected to Android Phone/Pad \n\r");
      }
      else if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ANCS_SERVICE ANCS Service [0x%04X - 0x%04X] is found !!! ==> connected to iOS Phone/Pad \n\r",ancs_context.ANCSServiceStartHandle,ancs_context.ANCSServiceEndHandle);
      }
    }
    break; /* GATT_PROC_DISC_ANCS_SERVICE */

    case GATT_PROC_DISC_ALL_PRIMARY_SERVICES:
    {
      ancs_context.state = ANCS_DISCOVER_ALL_SERVICES;
      /* discover all services */
      result = aci_gatt_disc_all_primary_services(ancs_context.connection_handle);
      gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES ALL services discovered Successfully \n");
      }
      else 
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES aci_gatt_disc_all_primary_services cmd NOK status =0x%02X \n",result);
      }
      
      if ( (ancs_context.ANCSServiceStartHandle == 0x0000) && (ancs_context.ANCSServiceEndHandle == 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES ANCS Service is NOT found !!! \n\r");
      }
      else if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES ANCS Service [0x%04X - 0x%04X] is found !!! \n\r",ancs_context.ANCSServiceStartHandle,ancs_context.ANCSServiceEndHandle);
        APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES GATT Service [0x%04X - 0x%04X] is found !!! \n\r",ancs_context.GATTServiceStartHandle,ancs_context.GATTServiceEndHandle);
      }		
    }
    break; /* GATT_PROC_DISC_ALL_PRIMARY_SERVICES */

