STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
    case GATT_PROC_DISC_ALL_CHARS:
    {
      ancs_context.state = ANCS_DISCOVER_ALL_CHARS;
      APP_DBG_MSG("ANCS_DISCOVER_ALL_CHARS connection_handle=0x%04X ALLServiceHandle[%04X - %04X] ANCSServiceHandle[%04X - %04X]\n",
      									ancs_context.connection_handle,
      									ancs_context.ALLServiceStartHandle,	ancs_context.ALLServiceEndHandle,
      									ancs_context.ANCSServiceStartHandle, ancs_context.ANCSServiceStartHandle);
      
      result = aci_gatt_disc_all_char_of_service(
      									 ancs_context.connection_handle,
      									 ancs_context.ALLServiceStartHandle,
      									 ancs_context.ALLServiceEndHandle);
      gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT); 
      if (result == BLE_STATUS_SUCCESS)
      {
      APP_DBG_MSG("ALL characteristics discovered Successfully \n\r");
      }
      else
      {
      APP_DBG_MSG("ALL characteristics discovery Failed \n\r");
      }
	  
      if( (ancs_context.ANCSNotificationSourceCharStartHdle != 0x0000) && (ancs_context.ANCSNotificationSourceCharValueHdle != 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_CHARS ANCSNotificationSourceCharStartHdle=0x%04X  ANCSNotificationSourceCharValueHdle=0x%04X \n\r",ancs_context.ANCSNotificationSourceCharStartHdle,ancs_context.ANCSNotificationSourceCharValueHdle);
      }
      if( (ancs_context.ANCSDataSourceCharStartHdle!= 0x0000) && (ancs_context.ANCSDataSourceCharValueHdle != 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_CHARS ANCSDataSourceCharStartHdle=0x%04X  ANCSDataSourceCharValueHdle=0x%04X \n\r",ancs_context.ANCSDataSourceCharStartHdle,ancs_context.ANCSDataSourceCharValueHdle);
      }
      if( (ancs_context.ANCSControlPointCharStartHdle!= 0x0000) && (ancs_context.ANCSControlPointCharValueHdle != 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_CHARS ANCSControlPointCharStartHdle=0x%04X  ANCSControlPointCharValueHdle=0x%04X \n\r",ancs_context.ANCSControlPointCharStartHdle,ancs_context.ANCSControlPointCharValueHdle);
      }
      if( (ancs_context.ServiceChangedCharStartHdle != 0x0000) && (ancs_context.ServiceChangedCharValueHdle != 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_CHARS ServiceChangedCharStartHdle=0x%04X  ServiceChangedCharValueHdle=0x%04X \n\r",ancs_context.ServiceChangedCharStartHdle,ancs_context.ServiceChangedCharValueHdle);
      } 
    }
    break; /* GATT_PROC_DISC_ALL_CHARS */

    case GATT_PROC_DISC_ALL_DESCS:
    {
      ancs_context.state = ANCS_DISCOVER_ALL_CHAR_DESCS;
      APP_DBG_MSG("ANCS_DISCOVER_ALL_CHAR_DESCS [%04X - %04X]\n",
      							   ancs_context.ALLServiceStartHandle,
      							   ancs_context.ALLServiceEndHandle);
      result = aci_gatt_disc_all_char_desc(
      							   ancs_context.connection_handle,
      							   ancs_context.ALLServiceStartHandle,
      							   ancs_context.ALLServiceEndHandle);
      gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("All characteristic descriptors discovered Successfully \n\r");
      }
      else
      {
        APP_DBG_MSG("All characteristic descriptors discovery Failed \n\r");
      }

      if( (ancs_context.ANCSNotificationSourceCharDescHdle!= 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_DESCS ANCSNotificationSourceCharDescHdle=0x%04X \n\r",ancs_context.ANCSNotificationSourceCharDescHdle);
      }
      if( (ancs_context.ANCSControlPointCharDescHdle!= 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_DESCS ANCSControlPointCharDescHdle=0x%04X \n\r",ancs_context.ANCSControlPointCharDescHdle);
      }
      if( (ancs_context.ANCSDataSourceCharDescHdle!= 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_DESCS ANCSDataSourceCharDescHdle=0x%04X \n\r",ancs_context.ANCSDataSourceCharDescHdle);
      }
      if( (ancs_context.ServiceChangedCharDescHdle != 0x0000) )
      {
        APP_DBG_MSG("GATT_PROC_DISC_ALL_DESCS ServiceChangedCharDescHdle=0x%04X \n\r",ancs_context.ServiceChangedCharDescHdle);
      }
    }
    break; /* GATT_PROC_DISC_ALL_DESCS */

    case GATT_PROC_ENABLE_ALL_NOTIFICATIONS:
    {
      uint16_t enable = 0x0001;

      if(ancs_context.ServiceChangedCharDescHdle != 0x0000)
      {	  
        ancs_context.state = ANCS_ENABLE_NOTIFICATION_SERVICE_CHANGED_DESC;
        result = aci_gatt_write_char_desc(
        						  ancs_context.connection_handle,
        						  ancs_context.ServiceChangedCharDescHdle,
        						  2,
        						  (uint8_t *) &enable);
        gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
        if (result == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("ServiceChangedCharDescHdle=0x%04X notification enabled Successfully \n\r",ancs_context.ServiceChangedCharDescHdle);
        }
        else
        {
          APP_DBG_MSG("ServiceChangedCharDescHdle=0x%04X notification enabled Failed BLE_STATUS_NOT_ALLOWED=0x%02x result=0x%02X\n",
  	  	ancs_context.ServiceChangedCharDescHdle,BLE_STATUS_NOT_ALLOWED,result);
        }
      }

	if(ancs_context.ANCSDataSourceCharDescHdle != 0x0000)
      {
        ancs_context.state = ANCS_ENABLE_NOTIFICATION_DATA_SOURCE_DESC;
        APP_DBG_MSG("ANCS_ENABLE_NOTIFICATION_DATA_SOURCE_DESC 0x%04X 0x%04X \n",
      							ancs_context.connection_handle,
      							ancs_context.ANCSDataSourceCharDescHdle);		
        result = aci_gatt_write_char_desc(
        							ancs_context.connection_handle,
        							ancs_context.ANCSDataSourceCharDescHdle,
        							2,
        							(uint8_t *) &enable);
        gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
        if (result == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("ANCSDataSourceCharDescHdle notification enabled Successfully \n\r");
        }
        else
        {
          APP_DBG_MSG("ANCSDataSourceCharDescHdle=0x%04X notification enabled Failed BLE_STATUS_NOT_ALLOWED=0x%02x result=0x%02X\n",
		  	ancs_context.ANCSDataSourceCharDescHdle,BLE_STATUS_NOT_ALLOWED,result);
        }
      }

	if(ancs_context.ANCSNotificationSourceCharDescHdle != 0x0000)
      {
        ancs_context.state = ANCS_ENABLE_NOTIFICATION_NOTIFICATION_SOURCE_DESC;
        APP_DBG_MSG("ANCS_ENABLE_NOTIFICATION_NOTIFICATION_SOURCE_DESC 0x%04X 0x%04X \n",
        							ancs_context.connection_handle,
        							ancs_context.ANCSNotificationSourceCharDescHdle);
        result = aci_gatt_write_char_desc(
        				  		  ancs_context.connection_handle,
        				  		  ancs_context.ANCSNotificationSourceCharDescHdle,
        				  		  2,
        				  		  (uint8_t *) &enable);
        gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
        if (result == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("ANCSNotificationSourceCharDescHdle notification enabled Successfully \n\r");
	     ancs_context.state = ANCS_INITIALIZED;
        }
        else
        {
          APP_DBG_MSG("ANCSNotificationSourceCharDescHdle notification enabled Failed result=0x%02X\n",result);
        }
      }
    }
    break; /* GATT_PROC_ENABLE_ALL_NOTIFICATIONS */
	
  default:
  	break;
  }
}

static void AncsProcReq(AncsProcId_t AncsProcId)
{
  switch (AncsProcId)
  {
	  
    case ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE:
    {
      ancs_context.state = ANCS_GET_NOTIFICATION_ATTRIBUTE;
      if ( (ancs_context.notifyEntry == INVALID_NOTIFY_ENTRY) || (ancs_context.notifyEntry >= MAX_NMB_NOTIFY) )
      {
        APP_DBG_MSG("ANCS_GET_NOTIFICATION_ATTRIBUTE INVALID_NOTIFY_ENTRY %d \n\r",ancs_context.notifyEntry);
        break;
      }
      else
      {
        APP_DBG_MSG("ANCS_GET_NOTIFICATION_ATTRIBUTE interact with iOS NotificationID 0x%08x, retrieve more information\n\r",
        ancs_context.notifyList[ancs_context.notifyEntry].notifUID);
      }
      
