STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/ancs_client_app.c
      notificationAttr_type attr;
      attr.UID = ancs_context.notifyList[ancs_context.notifyEntry].notifUID;
      attr.appID_flag = TRUE;
      attr.title_flag = TRUE;
      attr.title_max_size = MAX_DATA_LEN;
      attr.subtitle_flag = TRUE;
      attr.subtitle_max_size = MAX_DATA_LEN;
      attr.message_flag = TRUE;
      attr.message_max_size = MAX_DATA_LEN;
      attr.messageSize_flag = TRUE;
      attr.date_flag = TRUE;
      attr.positiveAction_flag = TRUE;
      attr.negativeAction_flag = TRUE;
      
      ANCS_Cmd_GetNotificationAttr(attr);
    }
    break; /* ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE */
	  
    case ANCS_PROC_GET_APP_ATTRIBUTE:
    {
      ancs_context.state = ANCS_GET_APP_ATTRIBUTE;
      APP_DBG_MSG("ANCS_GET_APP_ATTRIBUTE AppIdentifierLength=%d AppIdentifier:%s \n\r",
      ancs_context.AppIdentifierLength,ancs_context.AppIdentifier);
      ANCS_Cmd_GetAppAttr(ancs_context.AppIdentifierLength, (char*)ancs_context.AppIdentifier);
    }
    break; /* ANCS_PROC_GET_APP_ATTRIBUTE */
	  
    case ANCS_PROC_PERFORM_NOTIFICATION_ACTION:
    {
      ancs_context.state = ANCS_PERFORM_NOTIFICATION_ACTION;
      ActionID actID = ActionIDPositive;
      if ( (ancs_context.notifyEntry == INVALID_NOTIFY_ENTRY) || (ancs_context.notifyEntry >= MAX_NMB_NOTIFY) )
      {
        APP_DBG_MSG("ANCS_PERFORM_NOTIFICATION_ACTION INVALID_NOTIFY_ENTRY %d \n\r",ancs_context.notifyEntry);
        break;
      }
      else
      {
        APP_DBG_MSG("ANCS_PERFORM_NOTIFICATION_ACTION notifyEntry=%d NotificationID 0x%08x actID=%d \n\r",
        ancs_context.notifyEntry,ancs_context.notifyList[ancs_context.notifyEntry].notifUID,actID);
      }
      
      /*Here you can add interface to get actionID through UART input or button press */
      actID = ANCS_App_Get_ActionID();
      ANCS_Cmd_PerformNotificationAction(ancs_context.notifyList[ancs_context.notifyEntry].notifUID,actID);
      
      APP_DBG_MSG("ANCS_PERFORM_NOTIFICATION_ACTION notifyEntry=%d Removed\n\r", ancs_context.notifyEntry);
      ancs_context.notifyList[ancs_context.notifyEntry].used = FALSE;
    }
    break; /* ANCS_PROC_PERFORM_NOTIFICATION_ACTION */

    default:
    break;
  }
}

void ANCS_App_Notification( Connection_Context_t *pNotification )
{
  uint8_t status = BLE_STATUS_SUCCESS;

  switch (pNotification->Evt_Opcode)
  {
    case ANCS_CONNECTED:
    {
      ancs_context.connection_handle = pNotification->connection_handle; /* register */
      ancs_context.state = ANCS_DISCOVER_ANCS_SERVICE;
      APP_DBG_MSG("ANCS_CONNECTED ==> ANCS_DISCOVER_ANCS_SERVICE \n\r");
	  
      Ancs_Mgr();
    }
    break;
     
    case ANCS_DISCONN_COMPLETE:
    {
      APP_DBG_MSG("ANCS_DISCONN_COMPLETE \n\r");
      if(ancs_context.state == ANCS_DISCONNECTING)
        gap_cmd_resp_release(0);
	  
      ancs_context.state = ANCS_DISCONN_COMPLETE;
      ANCS_Client_Reset();
    }
    break;

    case ANCS_PASS_KEY_REQUEST:
    {
      ancs_context.state = ANCS_PASS_KEY_RESPONSE;
      APP_DBG_MSG("ANCS_PASS_KEY_REQUEST ==> ANCS_PASS_KEY_RESPONSE \n\r");
      Ancs_Mgr();
    }
    break;

    case ANCS_NUMERIC_COMPARISON_VALUE_CONFIRM:
    {
      ancs_context.state = ANCS_NUMERIC_COMPARISON_VALUE_CONFIRM;
      APP_DBG_MSG("ANCS_NUMERIC_COMPARISON_VALUE_CONFIRM \n\r");
      Ancs_Mgr();
    }
    break;
	
    case ANCS_SECURITY_INITIATED:
    {
      ancs_context.state = ANCS_SECURITY_INITIATED;
      APP_DBG_MSG("ANCS_SECURITY_INITIATED \n\r");
      gap_cmd_resp_release(0);
    }
    break;

    case ANCS_PAIRING_COMPLETE:
    {
      uint8_t Security_Mode, Security_Level;
  
      status = aci_gap_get_security_level(ancs_context.connection_handle,&Security_Mode,&Security_Level);
      if (status == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("ANCS_PAIRING_COMPLETE Peer_Bonded=%d Security_Mode=%d Security_Level=%d \n",ancs_context.Peer_Bonded, Security_Mode, Security_Level);
      }
	  
      if (ancs_context.Peer_Bonded == 0x00)/* only for the first paring complete*/
      { 
        status = aci_gap_is_device_bonded(ancs_context.Peer_Address_Type,ancs_context.Peer_Address);
        if (status == BLE_STATUS_SUCCESS)
        {
          ancs_context.Peer_Bonded = 0x01;
        }
        else 
        {
          ancs_context.Peer_Bonded = 0x00;
        }
		
        APP_DBG_MSG("ANCS_PAIRING_COMPLETE  Peer_Bonded from 0x00 ==> %d Term Connection for the first pairing complete to save bonding infomation !!! \n\r",ancs_context.Peer_Bonded);
		 
         for (int loop=0;loop<10;loop++) /* */
         {
           /* hci_disconnection_complete_event event will be generated when the link is disconnected. 
           It is important to leave an 100 ms blank window before sending any new command (including system hardware reset), 
           since immediately after @ref hci_disconnection_complete_event event, system could save important information in non volatile memory. */
           int cnt = 1000000;
           while(cnt--);
           printf(".\n\r");
        }
		 
        status = aci_gap_terminate(ancs_context.connection_handle, 0x13);
        if (status == BLE_STATUS_SUCCESS)
        {
          if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
          {
            ANCS_Client_Reset();
            gap_cmd_resp_release(0);
          }
        }		 
      }
	else if(ancs_context.Peer_Bonded == 0x01)
	{
	  if( (ancs_context.Security_Mode == 0x01) && (ancs_context.Security_Level == 0x01) )
	  {
	    if( (Security_Mode == 0x01) && (Security_Level >= 0x02) )
          {
            APP_DBG_MSG("ANCS_PAIRING_COMPLETE  Security_Level=%d ==> Security_Level=%d \n\r",ancs_context.Security_Level,Security_Level);
            ancs_context.Security_Level = Security_Level;  
     	     ancs_context.Security_Mode = Security_Mode;  
          }
	  }

       if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
         gap_cmd_resp_release(0);
      }
    }
    break; /* ANCS_PAIRING_COMPLETE */

    case ANCS_ALLOW_REBOND:
    {
      ancs_context.state = ANCS_ALLOW_REBOND;
      APP_DBG_MSG("ANCS_ALLOW_REBOND \n\r");
      Ancs_Mgr();
    }
    break;
	
    case ANCS_MTU_UPDATE:
    {
      APP_DBG_MSG("ANCS_MTU_UPDATE \n\r");
      ancs_context.state = ANCS_MTU_UPDATE;
      Ancs_Mgr();
    }
    break;
	
    case ANCS_MTU_EXCHANGE_COMPLETE:
    {
      APP_DBG_MSG("ANCS_MTU_EXCHANGE_COMPLETE \n\r"); 
      if(ancs_context.state == ANCS_MTU_UPDATE)
         gatt_cmd_resp_release(0);
	
      ancs_context.state = ANCS_MTU_EXCHANGE_COMPLETE;
    }
    break;

    case ANCS_DISCOVER_ANCS_SERVICE:
    {
      APP_DBG_MSG("ANCS_DISCOVER_ANCS_SERVICE \n\r");
      ancs_context.state = ANCS_DISCOVER_ANCS_SERVICE;
      Ancs_Mgr();
    }
    break;
	
    case ANCS_CHECK_NOTIFICATION:
    {
      ancs_context.state = ANCS_CHECK_NOTIFICATION;
      APP_DBG_MSG(" ==> ANCS_CHECK_NOTIFICATION \n\r");

      for (uint8_t idx=0; idx<MAX_NMB_NOTIFY; idx++) 
      {
        if (ancs_context.notifyList[idx].used) 
        {	  	
          ANCS_Notification_Check(ancs_context.notifyList[idx].evFlag);
          Ancs_Mgr();
	   break;
        }
      }
    }
    break;
	
    default:
      break;

  }
  return;
}





/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
